Управление_гостиницами_EDT/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗапись</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезопасныйВходНаСерверВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезопасныйВходНаСерверИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияПисемНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервераОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторизоватьсяНаСервереПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Протокол</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_гостиницами_EDT/src/CommonModules/РаботаСПочтовымиСообщениямиСлужебный/Module.bsl
Процедура ДобавитьПолеЗапроса(Выражение,Псевдоним,ПоляЗапроса,Колонки)
	ПоляЗапроса.Добавить(Выражение);
	ТекКолонка = Колонки.Получить(ПоляЗапроса.Количество()-1);
	ТекКолонка.Псевдоним = Псевдоним;
КонецПроцедуры


Процедура ДобавитьПоляЗапроса(ПоляЗапроса,Колонки,Протокол)
	ДобавитьПолеЗапроса("УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты","АдресСервера" + Протокол,ПоляЗапроса,Колонки);
	ДобавитьПолеЗапроса("УчетныеЗаписиЭлектроннойПочты.ЗащищенноеСоединениеДляВходящейПочты","Порт" + Протокол,ПоляЗапроса,Колонки);
	ДобавитьПолеЗапроса("УчетныеЗаписиЭлектроннойПочты.Пользователь","ИспользоватьSSL" + Протокол,ПоляЗапроса,Колонки);
	ДобавитьПолеЗапроса("УчетныеЗаписиЭлектроннойПочты.БезопасныйВходНаСерверВходящейПочты","ТолькоЗащищеннаяАутентификация" + Протокол,ПоляЗапроса,Колонки);
	ДобавитьПолеЗапроса("УчетныеЗаписиЭлектроннойПочты.БезопасныйВходНаСерверВходящейПочты","Пользователь" + ?(Протокол = "POP3","",Протокол),ПоляЗапроса,Колонки);
КонецПроцедуры


Функция ИнтернетПочтовыйПрофиль(УчетнаяЗапись,ВходящаяПочта)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты КАК АдресСервераIMAP,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты КАК ПортIMAP,
		|	УчетныеЗаписиЭлектроннойПочты.ЗащищенноеСоединениеДляВходящейПочты КАК ИспользоватьSSLIMAP,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь КАК ПользовательIMAP,
		|	УчетныеЗаписиЭлектроннойПочты.БезопасныйВходНаСерверВходящейПочты КАК ТолькоЗащищеннаяАутентификацияIMAP,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты КАК АдресСервераPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты КАК ПортPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.ЗащищенноеСоединениеДляВходящейПочты КАК ИспользоватьSSLPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь КАК Пользователь,
		|	УчетныеЗаписиЭлектроннойПочты.БезопасныйВходНаСерверВходящейПочты КАК ТолькоЗащищеннаяАутентификацияPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты КАК АдресСервераSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераИсходящейПочты КАК ПортSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ЗащищенноеСоединениеДляИсходящейПочты КАК ИспользоватьSSLSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.АвторизоватьсяНаСервереПередОтправкой КАК POP3ПередSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательСервераОтправки КАК ПользовательSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.БезопасныйВходНаСерверИсходящейПочты КАК ТолькоЗащищеннаяАутентификацияSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.Протокол КАК Протокол,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания КАК Таймаут
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка = &УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	СхемаТест = Новый СхемаЗапроса;
	СхемаТест.УстановитьТекстЗапроса(Запрос.Текст);
	
	УстановитьПривилегированныйРежим(Истина);
	Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УчетнаяЗапись, "Пароль,ПарольSMTP");
	УстановитьПривилегированныйРежим(Ложь);
	Результат = Новый ИнтернетПочтовыйПрофиль;
	
	Схема = Новый СхемаЗапроса;
	Пакет = Схема.ПакетЗапросов[0];
	Пакет.ВыбиратьРазрешенные = Истина;
	Оператор = Пакет.Операторы[0];
	Источник = Оператор.Источники.Добавить("Справочник.УчетныеЗаписиЭлектроннойПочты","УчетныеЗаписиЭлектроннойПочты");
	Оператор.Отбор.Добавить("УчетныеЗаписиЭлектроннойПочты.Ссылка = &УчетнаяЗапись");
	Колонки = Пакет.Колонки;
	Если ВходящаяПочта Тогда
		Если УчетнаяЗапись.Протокол = "IMAP" Тогда
			ДобавитьПоляЗапроса(Оператор.ВыбираемыеПоля,Колонки,"IMAP");
			Результат.ПарольIMAP = Пароли.Пароль;
		Иначе
			ДобавитьПоляЗапроса(Оператор.ВыбираемыеПоля,Колонки,"POP3");	
			Результат.Пароль = Пароли.Пароль;
		КонецЕсли; 
		
	Иначе
		
	
	КонецЕсли; 
	
	
	
КонецФункции // ИнтернетПочтовыйПрофиль()

Процедура ПроверитьВозможностьПодключенияКСерверу(Знач УчетнаяЗапись, ВходящаяПочта)
	
	Профиль = ИнтернетПочтовыйПрофиль(УчетнаяЗапись, ВходящаяПочта);
	//Соединение = Новый ИнтернетПочта;
	//
	//Если ВходящаяПочта Тогда
	//	Протокол = ПротоколИнтернетПочты.POP3;
	//	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ПротоколВходящейПочты") = "IMAP" Тогда
	//		Протокол = ПротоколИнтернетПочты.IMAP;
	//	КонецЕсли;
	//	Соединение.Подключиться(Профиль, Протокол);
	//Иначе
	//	Соединение.Подключиться(Профиль);
	//КонецЕсли;
	//
	//Соединение.Отключиться();   
	
КонецПроцедуры

Процедура ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(УчетнаяЗапись, СообщениеОбОшибке) Экспорт
	
	НастройкиУчетнойЗаписи = Новый Структура("ДляОтправки,ДляПолучения", );
	ЗаполнитьЗначенияСвойств(НастройкиУчетнойЗаписи,УчетнаяЗапись,"ДляОтправки,ДляПолучения");
	
	
	Если НастройкиУчетнойЗаписи.ДляОтправки Тогда
		Попытка
			ПроверитьВозможностьПодключенияКСерверу(УчетнаяЗапись, Ложь);
		Исключение
			СообщениеОбОшибке = "Ошибка в настройках исходящей почты: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
	Если НастройкиУчетнойЗаписи.ДляПолучения Тогда
		Попытка
			ПроверитьВозможностьПодключенияКСерверу(УчетнаяЗапись, Истина);
		Исключение
			Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + Символы.ПС;
			КонецЕсли;
			СообщениеОбОшибке = СообщениеОбОшибке + "Ошибка в настройках входящей почты: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
